Repository: Sevittt/education_app
Catalog: education_app/lib/l10n/app_*.arb
Languages: ru, uz

# registeredOnLabel
source: Registered
ru: Зарегистрирован
uz: Ro'yxatdan o'tgan

# manageUsersSubtitleNow
source: View and search registered users
ru: Просмотр и поиск зарегистрированных пользователей
uz: Ro'yxatdan o'tgan foydalanuvchilarni ko'rish va qidirish

# manageResourcesSubtitleNow
source: View, edit, or delete any learning resource
ru: Просмотр, редактирование или удаление любого учебного ресурса
uz: Har qanday o'quv manbasini ko'rish, tahrirlash yoki o'chirish

# confirmDeleteResourceMessage
source: Are you sure you want to delete resource "{resourceTitle}"?
ru: Вы уверены, что хотите удалить ресурс "{resourceTitle}"?
uz: Siz "{resourceTitle}" manbasini o'chirib tashlamoqchimisiz?

# failedToDeleteResource
source: Failed to delete resource "{resourceTitle}": {error}
ru: Не удалось удалить ресурс "{resourceTitle}": {error}
uz: "{resourceTitle}" manbasini o'chirib bo'lmadi: {error}

# errorLoadingResources
source: Error loading resources: {error}
ru: Ошибка загрузки ресурсов: {error}
uz: Resurslarni yuklashda xatolik yuz berdi: {error}

# noResourcesFoundManager
source: No resources found in the system.
ru: Ресурсы в системе не найдены.
uz: Tizimda hech qanday manba topilmadi.

# editResourceTooltip
source: Edit Resource
ru: Изменить ресурс
uz: Resursni tahrirlash

# deleteResourceTooltip
source: Delete Resource
ru: Удалить ресурс
uz: Resursni o'chirish

# manageQuizzesTitle
source: Manage Quizzes
ru: Управление тестами
uz: Viktorinalarni boshqarish

# addQuizTooltip
source: Add New Quiz
ru: Добавить новый тест
uz: Yangi test qo'shish

# errorLoadingQuizzesAdmin
source: Error loading quizzes: {error}
ru: Ошибка загрузки тестов: {error}
uz: Viktorinalarni yuklashda xatolik yuz berdi: {error}

# noQuizzesFoundManager
source: No quizzes found. Add one!
ru: Тестов не найдено. Добавьте один!
uz: Hech qanday test topilmadi. Bittasini qo'shing!

# confirmDeleteQuizMessage
source: Are you sure you want to delete quiz "{quizTitle}" and all its questions? This action cannot be undone.
ru: Вы уверены, что хотите удалить тест "{quizTitle}" и все его вопросы? Это действие нельзя отменить.
uz: Siz "{quizTitle}" testini va uning barcha savollarini o'chirib tashlamoqchimisiz? Bu amalni ortga qaytarib bo'lmaydi.

# quizDeletedSuccess
source: Quiz "{quizTitle}" and its questions deleted successfully.
ru: Тест "{quizTitle}" и его вопросы успешно удалены.
uz: "{quizTitle}" testi va uning savollari muvaffaqiyatli o'chirildi.

# failedToDeleteQuiz
source: Failed to delete quiz "{quizTitle}": {error}
ru: Не удалось удалить тест "{quizTitle}": {error}
uz: "{quizTitle}" testini o'chirib bo'lmadi: {error}

# editDetailsButton
source: Edit Details
ru: Изменить сведения
uz: Tafsilotlarni tahrirlash

# manageQuestionsButton
source: Questions
ru: Вопросы
uz: Savollar

# deleteQuizTooltip
source: Delete Quiz and Questions
ru: Удалить тест и Вопросы
uz: Viktorina va savollarni o'chirish

# addQuizButton
source: Add Quiz
ru: Добавить тест
uz: Viktorina qo'shish

# manageQuizzesSubtitle
source: Oversee all quizzes and their questions
ru: Контролировать все тесты и их вопросы
uz: Barcha testlar va ularning savollarini nazorat qilish

# registrationEmailError
source: Please enter a valid email address
uz: Yaroqli elektron pochta manzilini kiriting

# dashboardXodimTitle
source: My Activity
uz: Mening Faoliyatim

# dashboardEkspertTitle
source: My Contributions
uz: Mening Hissam

# dashboardAdminTitle
source: System Overview
uz: Tizim Holati

# seeAllButton
source: See All
uz: Barchasini ko'rish

# noGuidesAuthored
source: You have not authored any guides yet.
uz: Siz hali hech qanday qo'llanma yaratmadingiz.

# adminStatUsers
source: Users
uz: Foydalanuvchilar

# adminStatGuides
source: Guides
uz: Qo'llanmalar

# adminStatQuizzes
source: Quizzes
uz: Viktorinalar

# orDivider
source: OR
uz: YOKI

source: Sign In with Google
uz: Google bilan kirish

# themeSystemDefault
source: System Default
uz: Tizim tili

# themeLight
source: Light Mode
uz: Yorug' rejim

# themeDark
source: Dark Mode
uz: Tungi rejim

# bioOptionalLabel
source: Bio (Optional)
uz: Bio (Ixtiyoriy)

# profilePictureUrlLabel
source: Profile Picture URL (Optional)
uz: Profil rasmi URL manzili (Ixtiyoriy)

# levelBeginner
source: Newbie
uz: Boshlang'ich

# levelIntermediate
source: Intermediate
uz: O'rta

# levelAdvanced
source: Advanced
uz: Ilg'or

# levelExpert
source: Expert
uz: Ekspert

source: Total Points
uz: Jami ballar

source: Next Level
uz: Keyingi daraja

# pointsToNextLevel
source: {points} XP to next level
uz: Keyingi darajaga {points} XP

# manageArticlesTitle
source: Articles
uz: Maqolalar Boshqaruvi

# manageArticlesSubtitle
source: Manage Knowledge Base
uz: Bilimlar bazasini boshqarish

# manageVideosTitle
source: Videos
uz: Video Darsliklar Boshqaruvi

# manageVideosSubtitle
source: Manage Video Tutorials
uz: Video darsliklarni boshqarish

# manageSystemsTitle
source: Systems
uz: Tizimlar Boshqaruvi

# manageSystemsSubtitle
source: Manage Systems Directory
uz: Tizimlar ma'lumotnomasini boshqarish

# manageFaqTitle
source: FAQ
uz: TSS

# manageFaqSubtitle
source: Manage FAQs
uz: TSSni boshqarish

# manageNotificationsTitle
source: Notifications
uz: Bildirishnomalar

# manageNotificationsSubtitle
source: Send Notifications
uz: Bildirishnomalarni yuborish

source: Select Language
uz: Tilni tanlang

# topicDeletedSuccess
source: "{topicTitle}" deleted successfully.
uz: "{topicTitle}" muvaffaqiyatli o'chirildi.

# failedToDeleteTopic
source: Failed to delete topic: {error}
uz: Mavzuni o'chirib bo'lmadi: {error}

# deleteTopicConfirmMessage
source: Are you sure you want to delete "{topicTitle}"?
uz: Siz "{topicTitle}" mavzusini o'chirib tashlamoqchimisiz?

# editTopicTooltip
source: Edit Topic
uz: Mavzuni tahrirlash

# deleteTopicConfirmTitle
source: Delete Topic
uz: Mavzuni o'chirish

# commentPlural
source: Comments
uz: Izohlar

# commentSingular
source: Comment
uz: Izoh

# deleteTopicTooltip
source: Delete Topic
uz: Mavzuni o'chirish

# faqCategoryLogin
source: Login Issues
uz: Kirish muammolari

# faqCategoryPassword
source: Password Issues
uz: Parol muammolari

# faqCategoryUpload
source: File Upload
uz: Fayl yuklash

# faqCategoryAccess
source: Access Rights
uz: Kirish huquqlari

# faqCategoryGeneral
source: General Questions
uz: Umumiy savollar

# faqCategoryTechnical
source: Technical Issues
uz: Texnik muammolar

source: All Categories
uz: Barcha toifalar

# noArticlesFound
source: No FAQs found
uz: Savollar topilmadi

# helpfulFeedback
source: Was this helpful?
uz: Bu foydali bo'ldimi?

# confirmDeleteArticleMessage
source: Are you sure you want to delete the article "{articleTitle}"?
uz: Siz "{articleTitle}" maqolasini o'chirib tashlamoqchimisiz?

# addArticleTitle
source: New Article
uz: Yangi Maqola

# editArticleTitle
source: Edit Article
uz: Maqolani Tahrirlash

# categoryLabel
source: Category
uz: Kategoriya

# contentLabel
source: Content (Markdown)
uz: Mazmuni (Markdown)

# tagsLabel
source: Tags (comma separated)
uz: Teglar (vergul bilan ajrating)

# tagsHint
source: e.g. court, law, code
uz: masalan: sud, qonun, kodeks

# noPdfSelected
source: No PDF file selected
uz: PDF fayl tanlanmagan

# uploadPdfTooltip
source: Upload PDF
uz: PDF yuklash

# currentFileLabel
source: Current file: {url}
uz: Joriy fayl: {url}

source: Existing PDF file
uz: Mavjud PDF fayl

# articleSavedSuccess
source: Article saved
uz: Maqola saqlandi

# titleRequired
source: Title is required
uz: Sarlavha kiritilishi shart

# contentRequired
source: Content is required
uz: Mazmun kiritilishi shart

# confirmDeleteVideoMessage
source: Are you sure you want to delete the video "{videoTitle}"?
uz: Siz "{videoTitle}" videosini o'chirib tashlamoqchimisiz?

# videoDeletedSuccess
source: Video deleted
uz: Video o'chirildi

source: No videos found
uz: Videolar yo'q

# addVideoTitle
source: New Video
uz: Yangi Video

# editVideoTitle
source: Edit Video
uz: Videoni Tahrirlash

# videoSavedSuccess
source: Video saved
uz: Video saqlandi

# youtubeIdHint
source: e.g. dQw4w9WgXcQ
uz: Masalan: dQw4w9WgXcQ

# youtubeIdRequired
source: YouTube ID is required
uz: YouTube ID kiritilishi shart

# systemOptionalLabel
source: System (Optional)
uz: Tizim (ixtiyoriy)

# notSelectedLabel
source: Not Selected
uz: Tanlanmagan

# durationLabel
source: Duration (seconds)
uz: Davomiyligi (soniya)

# durationHint
source: e.g. 600
uz: Masalan: 600

# durationRequired
source: Duration is required
uz: Davomiylik kiritilishi shart

# videoTagsHint
source: e.g. login, error, settings
uz: masalan: login, xatolik, sozlash

# descriptionRequired
source: Description is required
uz: Tavsif kiritilishi shart

# confirmDeleteSystemMessage
source: Are you sure you want to delete the system "{systemName}"?
uz: Siz "{systemName}" tizimini o'chirib tashlamoqchimisiz?

# systemDeletedSuccess
source: System deleted
uz: Tizim o'chirildi

source: No systems found
uz: Tizimlar yo'q

# addSystemTitle
source: New System
uz: Yangi Tizim

# editSystemTitle
source: Edit System
uz: Tizimni Tahrirlash

# systemSavedSuccess
source: System saved
uz: Tizim saqlandi

# shortNameLabel
source: Short Name
uz: Qisqa nomi

# shortNameHint
source: e.g. e-SUD
uz: Masalan: e-SUD

# nameRequired
source: Name is required
uz: Nom kiritilishi shart

# fullNameLabel
source: Full Name
uz: To'liq nomi

# fullNameRequired
source: Full name is required
uz: To'liq nom kiritilishi shart

# websiteUrlLabel
source: Website URL
uz: Veb-sayt manzili

# urlRequired
source: URL is required
uz: URL kiritilishi shart

# logoUrlRequired
source: Logo URL is required
uz: Logo URL kiritilishi shart

# statusLabel
source: Status
uz: Holati

# loginGuideIdLabel
source: Login Guide ID (Optional)
uz: Kirish qo'llanmasi ID (ixtiyoriy)

# videoGuideIdLabel
source: Video Guide ID (Optional)
uz: Video qo'llanma ID (ixtiyoriy)

# confirmDeleteFaqMessage
source: Are you sure you want to delete the question "{question}"?
uz: Siz "{question}" savolini o'chirib tashlamoqchimisiz?

# faqDeletedSuccess
source: Question deleted
uz: Savol o'chirildi

# noFaqsFound
source: No questions found
uz: Savollar yo'q

# addFaqTitle
source: New Question
uz: Yangi Savol

# editFaqTitle
source: Edit Question
uz: Savolni Tahrirlash

# faqSavedSuccess
source: Question saved
uz: Savol saqlandi

# questionLabel
source: Question
uz: Savol

# questionRequired
source: Question is required
uz: Savol kiritilishi shart

# answerLabel
source: Answer (Markdown)
uz: Javob (Markdown)

# answerRequired
source: Answer is required
uz: Javob kiritilishi shart

source: Add
uz: Qo'shish

# titleLabel
source: Title
uz: Sarlavha

source: Edit
uz: Tahrirlash

source: Delete
uz: O'chirish

source: Cancel
uz: Bekor qilish

source: Search...
uz: Qidirish...

# fieldRequired
source: Field is required
uz: Maydon to'ldirilishi shart

# confirmDelete
source: Are you sure you want to delete?
uz: Haqiqatan ham o'chirmoqchimisiz?

# successSaved
source: Saved successfully
uz: Muvaffaqiyatli saqlandi

# successDeleted
source: Deleted successfully
uz: Muvaffaqiyatli o'chirildi

# notificationManagementTitle
source: Notification Management
uz: Xabarnomalar Boshqaruvi

# notificationHistoryTitle
source: Notification History
uz: Xabarnomalar Tarixi

# notificationHistoryPlaceholder
source: History of sent notifications will appear here (coming soon).
uz: Bu yerda yuborilgan xabarnomalar tarixi ko'rinadi (tez orada).

# sendNewNotificationButton
source: Send New Notification
uz: Yangi Xabarnoma Yuborish

# sendNotificationTitle
source: Send Notification
uz: Xabarnoma Yuborish

# notificationSentSuccess
source: Notification sent
uz: Xabarnoma yuborildi

# notificationTitleLabel
source: Title
uz: Sarlavha

# notificationTitleRequired
source: Title is required
uz: Sarlavha kiritilishi shart

# notificationBodyLabel
source: Message Body
uz: Xabar matni

# notificationBodyRequired
source: Message body is required
uz: Matn kiritilishi shart

# notificationTypeLabel
source: Notification Type
uz: Xabarnoma turi

# targetAudienceLabel
source: Audience
uz: Auditoriya

# faqTitle
source: FAQ
uz: Ko'p so'raladigan savollar

source: Search help...
uz: Yordam izlash...

# settingsNotifications
source: Notifications
uz: Xabarnomalar

# changePasswordTitle
source: Change Password
uz: Parolni o'zgartirish

# helpCenterTitle
source: Help Center
uz: Yordam markazi

# settingsAbout
source: About App
uz: Ilova haqida

# passwordUpdatedSuccess
source: Password updated successfully
uz: Parol muvaffaqiyatli yangilandi

# errorWrongPassword
source: Incorrect current password
uz: Joriy parol noto'g'ri

source: Current Password
uz: Joriy parol

source: New Password
uz: Yangi parol

source: Confirm Password
uz: Parolni tasdiqlang

# passwordMismatch
source: Passwords do not match
uz: Parollar mos kelmadi

source: Save
uz: Saqlash

# resourceTabArticles
source: Articles
uz: Maqolalar

# resourceTabVideos
source: Videos
uz: Videolar

# resourceTabFiles
source: Files
uz: Fayllar

# systemsDirectoryTitle
source: Court Information Systems
uz: Sud Axborot Tizimlari

# bookmarkSaveTooltip
source: Bookmark
uz: Saqlash

# bookmarkRemoveTooltip
source: Remove Bookmark
uz: Olib tashlash

# resourceTypeOther
source: Others
uz: Boshqalar

# filesTabTitle
source: Files
uz: Fayllar

source: Open File
uz: Faylni ochish

source: File Size
uz: Fayl hajmi

source: Select File
uz: Fayl tanlang

source: Upload
uz: Yuklash

source: Processing...
uz: Bajarilmoqda...

# urlLabel
source: URL
uz: Havola (URL)

# resourceTypePDF
source: PDF Manual
uz: PDF Qo'llanma

# resourceTypeVideo
source: Video Tutorial
uz: Video Darslik

# resourceTypeLink
source: Web Link
uz: Veb Havola

source: Only Saved
uz: Faqat saqlanganlar

# searchArticlesPlaceholder
source: Search articles...
uz: Maqolalarni qidirish...

# filterAll
source: All
uz: Barchasi

source: No results found
uz: Hech narsa topilmadi

source: No articles available
uz: Maqolalar mavjud emas

source: No videos available
uz: Videolar mavjud emas

# actionCreateDiscussion
source: Create Discussion
uz: Muhokama yaratish

# actionCreateResource
source: Create Resource
uz: Resurs yaratish

# actionCreateQuiz
source: Create Quiz
uz: Test yaratish

# notificationsTitle
source: Notifications
uz: Xabarnomalar

source: Login required
uz: Tizimga kirish kerak

# markAllAsReadTooltip
source: Mark all as read
uz: Hammasini o'qilgan deb belgilash

# allNotificationsReadMessage
source: All notifications marked as read
uz: Barcha xabarnomalar o'qilgan deb belgilandi

source: No notifications
uz: Xabarnomalar yo'q

# closeAction
source: Close
uz: Yopish

# leaderboardTitle
source: Leaderboard
uz: Liderlar Jadvali

# pointsEarned
source: You earned {points} XP!
uz: Siz {points} XP oldingiz!

# levelUp
source: Congratulations! New Level: {level}
uz: Tabriklaymiz! Yangi daraja: {level}

source: Rank
uz: O'rin

# quizHistoryTitle
source: Quiz History
uz: Viktorina Tarixi

source: See All
uz: Barchasini ko'rish

source: Today
uz: Bugun

source: Yesterday
uz: Kecha

source: This Week
uz: Shu hafta

# older
source: Older Results
uz: Eski natijalar

source: Contact Support
uz: Qo'llab-quvvatlash

# landingTitle
source: Professional Platform
uz: Professional Platforma

# landingSubtitle
source: Elevate your legal knowledge. Anytime. Anywhere.
uz: Huquqiy bilimingizni oshiring. Istalgan vaqtda.

# landingLogin
source: Login
uz: Kirish

# landingRegister
source: Register
uz: Ro'yxatdan o'tish

# featureKnowledgeBase
source: Knowledge Base
uz: Bilimlar Bazasi

# featureKnowledgeBaseDesc
source: Access a vast library of legal resources and documents.
uz: Keng ko'lamli huquqiy resurslar va hujjatlar kutubxonasi.

# featureVideoTutorials
source: Video Tutorials
uz: Video Darsliklar

# featureVideoTutorialsDesc
source: Learn from expert-led video guides and webinars.
uz: Mutaxassislar tomonidan tayyorlangan video qo'llanmalar.

# featureGamification
source: Gamification
uz: Gamifikatsiya

# featureGamificationDesc
source: Earn XP, badges, and compete on the leaderboard.
uz: XP va nishonlar yig'ing, reytingda bellashing.

# analyticsTitle
source: Learning Analytics (xAPI)
uz: O'quv Tahlili (xAPI)

# analyticsSubtitle
source: Learning Records
uz: O'quv Yozuvlari

source: Total Records
uz: Jami Yozuvlar

source: Real-time
uz: Real vaqtda

source: Activity Distribution
uz: Faoliyat Taqsimoti

source: Recent Activity Feed
uz: So'nggi Faoliyatlar

# noRecords
source: No learning records found yet.
uz: Hozircha o'quv yozuvlari topilmadi.

source: Unknown User
uz: Noma'lum Foydalanuvchi

source: Unknown Object
uz: Noma'lum Obyekt

source: Just now
uz: Hozirgina

source: Quizzes
uz: Viktorinalar

source: Simulations
uz: Simulyatsiyalar

# catNewEmployees
source: New Employees
uz: Yangi Xodimlar

# catIctSpecialists
source: ICT Specialists
uz: AKT Mutaxassislari

# catSystems
source: Systems
uz: Tizimlar

# catAuth
source: Authentication
uz: Kirish/Login

# catGeneral
source: General
uz: Umumiy

# rankBeginner
source: Beginner
uz: Boshlang'ich

# rankIntermediate
source: Intermediate
uz: O'rta Daraja

# rankAdvanced
source: Advanced
uz: Ilg'or

# sysCatPrimary
source: Primary Systems
uz: Asosiy Tizimlar

# sysCatSecondary
source: Secondary Systems
uz: Qo'shimcha Tizimlar

# sysCatSupport
source: Support Systems
uz: Yordam Tizimlari

# sysStatusActive
source: Active
uz: Faol

# sysStatusMaintenance
source: Maintenance
uz: Ta'mirlashda

# sysStatusInactive
source: Inactive
uz: Nofaol

# videoViews
source: {count} views
uz: {count} ko'rishlar

# videoAuthorSubtitle
source: Author
uz: Muallif

# videoDescriptionTitle
source: Description
uz: Tavsif

# sysStatusDeprecated
source: Deprecated
uz: Eski Versiya

# sysStatusOffline
source: Offline
uz: O'chirilgan

# systemsDirectoryAll
source: All
uz: Barchasi

# systemsDirectoryError
source: An error occurred: {error}
uz: Xatolik yuz berdi: {error}

# systemsDirectoryEmpty
source: No systems available
uz: Tizimlar mavjud emas

# backToKnowledgeBase
source: Back to Guides
uz: Qo'llanmalarga qaytish

# quizSuccessMessage
source: Great result!
uz: Ajoyib natija!

# quizFailureMessage
source: Try again!
uz: Yana bir bor urinib ko'ring!

source: SPEED BONUS
uz: TEZKOR BONUS

# levelSpecialist
source: Specialist
uz: Mutaxassis

# levelMaster
source: Master
uz: Usta (Master)

source: Could not launch {url}
ru: Не удалось запустить {url}
