Repository: Sevittt/education_app
Catalog: education_app/lib/l10n/app_*.arb
Languages: ru, uz

# appTitle
source: Court Handbook
ru: Teach&Learn
uz: Sud Qo'llanmasi

source: Open in YouTube
uz: YouTube orqali ochish

source: Watch on YouTube
uz: YouTube da ko'rish

# loginWelcomeTitle
source: Welcome Back!
uz: Xush kelibsiz!

# loginWelcomeSubtitle
source: Sign in to continue
uz: Davom etish uchun kiring

# bottomNavHome
source: Home
uz: Bosh Sahifa

# bottomNavResources
source: Guides
uz: Qo'llanmalar

# bottomNavCommunity
source: Forum
uz: Munozara

# bottomNavProfile
source: Profile
uz: Profil

# resourcesScreenTitle
source: Guides & Manuals
uz: Qo'llanmalar va Yo'riqnomalar

# roleXodim
source: Staff
uz: Xodim

# roleEkspert
source: Expert
uz: Ekspert

# registrationTitle
source: Create Your Account
uz: Hisob Yaratish

# registrationSubtitle
source: Join the professional community!
uz: Professional hamjamiyatga qo'shiling!

# registrationFullNameLabel
source: Full Name
uz: To'liq Ism (F.I.Sh.)

# registrationFullNameError
source: Please enter your full name
uz: Iltimos, to'liq ismingizni kiriting

# registrationRoleLabel
source: Your Role
uz: Sizning Rolingiz

# registrationRoleError
source: Please select a role
uz: Iltimos, rolni tanlang

# registrationRoleXodim
source: Regular Staff
uz: Oddiy Xodim

# registrationRoleEkspert
source: Expert (Content Creator)
uz: Ekspert (Qo'llanma yaratuvchi)

# registrationPasswordLabel
source: Password
uz: Parol

# registrationPasswordError
source: Password must be at least 6 characters long
uz: Parol kamida 6 belgidan iborat bo'lishi kerak

# registrationConfirmPasswordLabel
source: Confirm Password
uz: Parolni tasdiqlang

# registrationConfirmPasswordError
source: Passwords do not match
uz: Parollar mos kelmadi

# registrationSignUpButton
source: Sign Up
uz: Ro'yxatdan o'tish

# registrationSwitchToLogin
source: Already have an account? Sign In
uz: Hisobingiz bormi? Kirish

# languageEnglish
source: English
ru: Английский (США)
uz: Ingliz tili

# languageUzbek
source: Uzbek
ru: Узбекский (Узбекистан)
uz: O'zbek tili

# languageRussian
source: Russian
ru: Русский (Россия)
uz: Rus tili

# languageSystemDefault
source: System Default
ru: Системный язык
uz: Tizim tili

# settingsScreenTitle
source: Settings
ru: Настройки
uz: Sozlamalar

# settingsLanguage
source: Language
ru: Язык
uz: Til

# settingsReceiveNotifications
source: Receive Notifications
ru: Получать уведомления
uz: Bildirishnomalarni qabul qilish

# settingsReceiveNotificationsSubtitle
source: Get updates about new resources and discussions
ru: Получайте обновления о новых ресурсах и обсуждениях
uz: Yangi manbalar va muhokamalar haqida yangilanishlarni oling

# settingsAllowLocation
source: Allow Location Access
ru: Разрешить доступ к местоположению
uz: Joylashuvga ruxsat berish

# settingsAllowLocationSubtitle
source: For features requiring your location (if any)
ru: Для функций, требующих вашего местоположения (если есть)
uz: Joylashuvingizni talab qiladigan funksiyalar uchun (agar mavjud bo'lsa)

# settingsChangePassword
source: Change Password
ru: Изменить пароль
uz: Parolni o'zgartirish

# settingsHelpCenter
source: Help Center
ru: Центр помощи
uz: Yordam markazi

# settingsAboutApp
source: About Court Handbook
ru: О Teach & Learn
uz: Sud Qo'llanmasi haqida

# settingsAppLegalese
source: © 2025 Court Handbook Project
ru: © 2025 Teach & Learn Проект
uz: © 2025 Sud Qo'llanmasi Loyihasi

# settingsAppDescription
source: Bridging the IT skills gap through collaborative learning and resource sharing.
ru: Преодоление разрыва в IT-навыках посредством совместного обучения и обмена ресурсами.
uz: Sud xodimlarining kasbiy kompetentligi uchun mobil platforma.

# errorPrefix
source: Error:
ru: Ошибка:
uz: Xatolik:

source: days
uz: kun

# resourcesNoResourcesFound
source: No resources found.
ru: Ресурсы не найдены.
uz: Resurslar topilmadi.

# loginButtonText
source: Login
ru: Войти
uz: Kirish

# signUpButtonText
source: Sign Up
ru: Зарегистрироваться
uz: Ro'yxatdan o'tish

# logoutButtonText
source: Logout
ru: Выйти
uz: Chiqish

# logoutConfirmTitle
source: Are you sure to logout
ru: Вы уверены, что хотите выйти?
uz: Chiqishga ishonchingiz komilmi?

# emailLabel
source: Email
ru: Электронная почта
uz: Elektron pochta

# passwordLabel
source: Password
ru: Пароль
uz: Parol

# homeDashboardTitle
source: Dashboard
ru: Панель управления
uz: Boshqaruv paneli

# communityScreenTitle
source: Forum
ru: Сообщество
uz: Hamjamiyat

# profileScreenTitle
source: Profile
ru: Профиль
uz: Profil

# editProfileButtonText
source: Edit Profile
ru: Редактировать профиль
uz: Profilni tahrirlash

# guestUser
source: Guest
ru: Гость
uz: Mehmon foydalanuvchi

source: Update your information
ru: Обновите вашу информацию
uz: Ma'lumotlaringizni yangilang

# loginToEditProfile
source: Log in to edit your profile
ru: Войдите, чтобы редактировать профиль
uz: Profilni tahrirlash uchun tizimga kiring

# settingsTitle
source: Settings
ru: Настройки
uz: Sozlamalar

# themeOptionsTitle
source: Theme Options
ru: Опции темы
uz: Mavzu variantlari

# logoutConfirmMessage
source: Are you sure you want to log out?
ru: Вы уверены, что хотите выйти из аккаунта?
uz: Chiqishni xohlaysizmi?

# cancelButton
source: Cancel
ru: Отмена
uz: Bekor qilish

# logoutButton
source: Log out
ru: Выйти
uz: Chiqish

# resourcesTitle
source: Guides
ru: Ресурсы
uz: Resurslar

# resourcesSearchHint
source: Search guides...
ru: Поиск ресурсов...
uz: Resurslarni qidirish...

# resourcesFilterByType
source: Filter by Type
ru: Фильтровать по типу
uz: Tur bo'yicha filtrlash

# resourcesAllTypes
source: All Types
ru: Все типы
uz: Barcha turlar

# resourcesNoResourcesMatch
source: No resources match your criteria.
ru: Ресурсы, соответствующие вашим критериям, не найдены.
uz: Sizning mezonlaringizga mos resurslar topilmadi.

# resourcesTryAdjusting
source: Try adjusting your search or filter.
ru: Попробуйте изменить поиск или фильтр.
uz: Qidiruv yoki filtringizni o'zgartirib ko'ring.

# resourcesCreateButton
source: Create
ru: Создать
uz: Yaratish

# resourceAddedSuccess
source: Resource added successfully!
ru: Ресурс успешно добавлен!
uz: Resurs muvaffaqiyatli qo'shildi!

# resourceAddedError
source: Error adding resource: {error}
ru: Ошибка при добавлении ресурса: {error}
uz: Resurs qo'shishda xatolik: {error}

# createResourceScreenTitle
source: Create New Guide
ru: Создать Новый Ресурс
uz: Yangi Resurs Yaratish

# createResourceFormWillBeHere
source: Resource creation form will be here.
ru: Форма создания ресурса будет здесь.
uz: Resurs yaratish shakli shu yerda bo'ladi.

# saveButtonText
source: Save Changes
ru: Сохранить изменения
uz: Saqlash

# createResourceTitleLabel
source: Title
ru: Название
uz: Sarlavha

# createResourceDescriptionLabel
source: Description
ru: Описание
uz: Tavsifi

# createResourceAuthorLabel
source: Author
ru: Автор
uz: Muallif

# createResourceTypeLabel
source: System Type
ru: Тип ресурса
uz: Resurs Turi

# createResourceValidationEmpty
source: Please enter a {fieldName}
ru: Пожалуйста, введите {fieldName}
uz: Iltimos kiriting {fieldName}

# createResourceValidationSelect
source: Please select a {fieldName}
ru: Пожалуйста, выберите {fieldName}
uz: Iltimos tanlang {fieldName}

# createResourceValidationInvalidUrl
source: Please enter a valid URL
ru: Введите действительный URL-адрес
uz: Yaroqli URL manzilini kiriting

# editButtonTooltip
source: Edit Resource
ru: Редактировать ресурс
uz: Resurs o'zgartirish

# editResourceScreenTitle
source: Edit Guide
ru: Редактировать ресурс
uz: Resurs o'zgartirish

# resourceTypeLabel
source: Type
ru: Тип
uz: Turi

# editTopicScreenTitle
source: Edit Discussion Topic
uz: Munozara Mavzusini Tahrirlash

# authorLabel
source: Author
ru: Автор
uz: Muallif

# dateAddedLabel
source: Added
ru: Добавлен
uz: Qo'shilgan

# launchingUrlMessage
source: Launching URL
ru: Запуск URL
uz: URL ishga tushirilmoqda

# descriptionLabel
source: Description
ru: Описание
uz: Tavsifi

# resourceUpdatedSuccess
source: Resource updated successfully!
ru: Ресурс успешно обновлен!
uz: Resurs muvaffaqiyatli yangilandi!

# resourceUpdatedError
source: Error updating resource: {error}
ru: Ошибка обновления ресурса: {error}
uz: Resursni yangilashda xatolik yuz berdi: {error}

# deleteResourceConfirmTitle
source: Confirm Deletion
ru: Подтвердите удаление
uz: Oʻchirishni tasdiqlang

# deleteResourceConfirmMessage
source: Are you sure you want to delete this resource? This action cannot be undone.
ru: Вы уверены, что хотите удалить этот ресурс? Это действие не может быть отменено.
uz: Haqiqatan ham bu manbani oʻchirib tashlamoqchimisiz? Bu amalni ortga qaytarib bo'lmaydi.

# cancelButtonText
source: Cancel
ru: Отмена
uz: Bekor qilish

# deleteButtonText
source: Delete
ru: Удалить
uz: Oʻchirish

# resourceDeletedSuccess
source: Resource "{resourceTitle}" deleted successfully.
ru: Ресурс "{resourceTitle}" успешно удален.
uz: "{resourceTitle}" resursi muvaffaqiyatli o'chirildi.

# resourceDeletedError
source: Error deleting resource: {error}
ru: Ошибка удаления ресурса: {error}
uz: Resursni o'chirishda xatolik yuz berdi: {error}

# deleteButtonTooltip
source: Delete Resource
ru: Удалить ресурс
uz: Resursni o'chirish

source: Create a New Quiz
ru: Создать новую викторину
uz: Yangi viktorina yaratish

source: Quiz Title
ru: Название викторины
uz: Viktorina nomi

# quizDescription
source: Description
ru: Описание
uz: Tavsif

source: Save and Add Questions
ru: Сохранить и добавить вопросы
uz: Saqlash va savollar qo'shish

source: Failed to create quiz
ru: Не удалось создать викторину
uz: Viktorina yaratib bo'lmadi

source: Add Questions
ru: Добавить вопросы
uz: Savollar qo'shish

source: FINISH
ru: ЗАВЕРШИТЬ
uz: TUGATISH

source: Question Text
ru: Текст вопроса
uz: Savol matni

source: Please enter a question
ru: Пожалуйста, введите вопрос
uz: Iltimos, savol kiriting

source: Question Type
ru: Тип вопроса
uz: Savol turi

source: Multiple Choice
ru: Множественный выбор
uz: Bir nechta tanlov

source: True/False
ru: Верно/Неверно
uz: To'g'ri/Noto'g'ri

# pleaseSelectCorrectAnswer
source: Please select a correct answer.
ru: Пожалуйста, выберите правильный ответ.
uz: Iltimos, to'g'ri javobni tanlang.

# option
source: Option {number}
ru: Вариант {number}
uz: Variant {number}

source: Please enter an option
ru: Пожалуйста, введите вариант
uz: Iltimos, variantni kiriting

source: Add Question
ru: Добавить вопрос
uz: Savol qo'shish

source: Question added successfully!
ru: Вопрос успешно добавлен!
uz: Savol muvaffaqiyatli qo'shildi!

source: Failed to add question
ru: Не удалось добавить вопрос
uz: Savol qo'shib bo'lmadi

source: No questions added yet.
ru: Вопросы еще не добавлены.
uz: Hozircha savollar qo'shilmagan.

# correctAnswer
source: Correct
ru: Правильный ответ
uz: To'g'ri javob

source: Quiz
ru: Викторина
uz: Viktorina

source: Quiz not found
ru: Викторина не найдена.
uz: Viktorina topilmadi

source: Failed to load quiz
ru: Не удалось загрузить викторину
uz: Viktorinani yuklab bo'lmadi

# question
source: Question {index}
ru: Вопрос {number}
uz: Savol {index}

# totalQuestions
source: Total: {total}
ru: из {total}
uz: Jami: {total}

# submitQuiz
source: Submit
ru: Отправить викторину
uz: Yakunlash

source: Next Question
ru: Следующий вопрос
uz: Keyingi savol

source: Quiz Results
ru: Результаты викторины
uz: Viktorina natijalari

# quizCompletionMessage
source: You have completed the quiz!
ru: Вы завершили викторину!
uz: Siz viktorinani yakunladingiz!

source: Your Score
ru: Ваш счет:
uz: Sizning natijangiz

source: Done
ru: Готово
uz: Bajarildi

source: Failed to save attempt
ru: Не удалось сохранить вашу попытку
uz: Natijani saqlashda xatolik

source: My Quiz History
ru: Моя история викторин
uz: Mening Viktorina Tarixim

# noQuizAttempts
source: You haven't attempted any quizzes yet.
ru: Вы еще не проходили ни одной викторины.
uz: Siz hali hech qanday viktorinada qatnashmadingiz.

source: Score
ru: Счет
uz: Bal

source: Role
ru: Роль
uz: Rol

source: Loading...
ru: Загрузка...
uz: Yuklanmoqda...

# relatedQuizzesTitle
source: Related Quizzes
ru: Похожие тесты
uz: Tegishli testlar

# noQuizzesAvailable
source: No quizzes available for this resource yet.
ru: Пока нет доступных тестов для этого ресурса
uz: Bu resurs uchun hozircha hech qanday test mavjud emas.

source: Error loading quizzes
ru: Ошибка загрузки тестов
uz: Viktorinalarni yuklashda xatolik

# invalidUrlFormat
source: Invalid URL format: {url}
ru: Неверный формат URL: {url}
uz: URL formati noto'g'ri: {url}

# errorLaunchingUrl
source: Error launching URL: {error}
ru: Ошибка запуска URL: {error}
uz: URLni ishga tushirishda xatolik yuz berdi: {error}

# createResourceValidationMinLength
source: {fieldName} must be at least {length} characters long
ru: {fieldName} должно быть не менее {length} символов в длину
uz: {fieldName} kamida {length} belgidan iborat bo'lishi kerak

# createResourceValidationMaxLength
source: {fieldName} cannot exceed {length} characters
ru: {fieldName} не может превышать {length} символов
uz: {fieldName} {length} belgidan oshmasligi kerak

# titleMinLength
source: Title must be at least 5 characters long
ru: Заголовок должен быть не менее 5 символов в длину
uz: Sarlavha kamida 5 ta belgidan iborat bo'lishi kerak

# titleMaxLength
source: Title cannot exceed 100 characters
ru: Заголовок не может превышать 100 символов
uz: Sarlavha 100 belgidan oshmasligi kerak

# createTopicScreenTitle
source: Start New Discussion
ru: Начать новое обсуждение
uz: Yangi muhokamani boshlash

# createTopicTitleLabel
source: Topic Title
ru: Заголовок темы
uz: Mavzu nomi

# createTopicContentLabel
source: Discussion Content
ru: Содержимое обсуждения
uz: Muhokama mazmuni

# createTopicButtonText
source: Create Discussion Topic
ru: Создать тему обсуждения
uz: Muhokama mavzusini yaratish

# mustBeLoggedInToCreateTopic
source: You must be logged in to create a topic.
ru: Чтобы создать тему, вам необходимо войти в систему.
uz: Mavzu yaratish uchun tizimga kirgan bo'lishingiz kerak.

# topicCreatedSuccess
source: Topic created successfully!
ru: Тема создана успешно!
uz: Mavzu muvaffaqiyatli yaratildi!

# failedToCreateTopic
source: Failed to create topic: {error}
ru: Не удалось создать тему: {error}
uz: Mavzu yaratib bo'lmadi: {error}

# createTopicValidationEmpty
source: {fieldName} cannot be empty.
ru: {fieldName} не может быть пустым.
uz: {fieldName} bo'sh bo'lishi mumkin emas.

# createTopicValidationMinLength
source: {fieldName} must be at least {length} characters long.
ru: {fieldName} должно быть не менее {length} символов в длину.
uz: {fieldName} kamida {length} belgidan iborat bo'lishi kerak.

# createTopicValidationMaxLength
source: {fieldName} cannot exceed {length} characters.
ru: {fieldName} не может превышать {length} символов в длину.
uz: {fieldName} {length} belgidan oshmasligi kerak.

# errorLoadingData
source: An error occurred while loading resources. Please try again.
ru: Произошла ошибка при загрузке ресурсов. Повторите попытку.
uz: Resurslarni yuklashda xatolik yuz berdi. Qayta urinib ko'ring.

# failedToUpdateTopic
source: Error updating topic: {error}
ru: Ошибка обновления темы: {error}
uz: Mavzuni yangilashda xatolik yuz berdi: {error}

# topicUpdatedSuccess
source: Topic updated successfully!
ru: Тема успешно обновлена!
uz: Mavzu muvaffaqiyatli yangilandi!

source: No discussions yet.
ru: Пока нет обсуждений.
uz: Hali muhokamalar yo'q.

# beTheFirstToStartConversation
source: Be the first to start a conversation!
ru: Начните разговор первым!
uz: Birinchi bo'lib suhbatni boshlang!

# mustBeLoggedInToCreateResource
source: You must be logged in to create a resource.
ru: Вы должны войти в систему, чтобы создать ресурс.
uz: Resurs yaratish uchun tizimga kirgan bo'lishingiz kerak.

# profileIncompleteToCreateResource
source: Your profile information is incomplete. Please update your name in your profile.
ru: Информация вашего профиля неполная. Пожалуйста, обновите свое имя в вашем профиле.
uz: Profilingiz haqidagi ma'lumotlar to'liq emas. Iltimos, profilingizda ismingizni yangilang.

# profileIncompleteToCreateTopic
source: Your profile name is not set. Please update your profile.
ru: Имя вашего профиля не установлено. Пожалуйста, обновите свой профиль.
uz: Profilingiz nomi belgilanmagan. Iltimos, profilingizni yangilang.

source: Comment cannot be empty.
ru: Комментарий не может быть пустым.
uz: Izoh bo'sh bo'lishi mumkin emas.

# mustBeLoggedInToComment
source: You must be logged in to comment.
ru: Вы должны войти в систему, чтобы оставить комментарий.
uz: Izoh berish uchun tizimga kirgan bo'lishingiz kerak.

source: Comment added successfully!
ru: Комментарий успешно добавлен!
uz: Izoh muvaffaqiyatli qo'shildi!

# failedToAddComment
source: Failed to add comment: {error}
ru: Не удалось добавить комментарий: {error}
uz: Izoh qo'shib bo'lmadi: {error}

# postedBy
source: Posted by {authorName}
ru: Опубликовано {authorName}
uz: Muallif: {authorName}

source: on {date}
ru: в {date}
uz: kun {date}

# repliesTitle
source: Replies
ru: Ответы
uz: Javoblar

# errorLoadingComments
source: Error loading comments: {error}
ru: Ошибка загрузки комментариев: {error}
uz: Izohlarni yuklashda xatolik yuz berdi: {error}

# noRepliesYet
source: No replies yet. Be the first to comment!
ru: Пока нет ответов. Станьте первым, кто оставит комментарий!
uz: Hali javob yo'q. Birinchi bo'lib fikr bildiring!

# writeAReplyHint
source: Write a reply...
ru: Напишите ответ...
uz: Javob yozing...

# sendCommentTooltip
source: Send Comment
ru: Отправить комментарий
uz: Izoh yuborish

# welcomeBack
source: Welcome back, {userName}!
ru: С возвращением, {userName}!
uz: Qaytib xush kelibsiz, {userName}!

# readyToLearnSomethingNew
source: Ready to learn something new today?
ru: Готовы узнать что-то новое сегодня?
uz: Bugun yangi narsalarni o'rganishga tayyormisiz?

# quickAccessTitle
source: Quick Access
ru: Быстрый доступ
uz: Tez kirish

# communityTitle
source: Forum
ru: Сообщество
uz: Hamjamiyat

# profileTitle
source: Profile
ru: Профиль
uz: Profil

# latestNewsTitle
source: Latest News
ru: Последние новости
uz: So'nggi yangiliklar

# sourceLabel
source: Source
ru: Источник
uz: Manba

# quizzesTitle
source: Quizzes
ru: Тестовые задания
uz: Viktorinalar

source: URL cannot be empty
ru: URL не может быть пустым
uz: URL bo'sh bo'lishi mumkin emas

# errorLoadingNews
source: Error loading news: {error}
ru: Ошибка загрузки новостей: {error}
uz: Yangiliklarni yuklashda xatolik yuz berdi: {error}

# noNewsAvailable
source: No news available at the moment.
ru: В данный момент новостей нет.
uz: Hozirda hech qanday yangilik mavjud emas.

# adminPanelTitle
source: Admin Panel
ru: Панель администратора
uz: Admin paneli

# manageNewsTitle
source: Manage News
ru: Управление новостями
uz: Yangiliklar Boshqaruvi

# manageNewsSubtitle
source: Add, edit, or delete news articles
ru: Добавление, редактирование или удаление новостных статей
uz: Yangilik maqolalarini qo'shish, tahrirlash yoki o'chirish

# manageUsersTitle
source: Manage Users
ru: Управление пользователями
uz: Foydalanuvchilarni boshqarish

# manageUsersSubtitle
source: View users and manage roles (future)
ru: Просмотр пользователей и управление ролями (в будущем)
uz: Foydalanuvchilarni ko'rish va rollarni boshqarish (kelajakda)

# manageResourcesTitle
source: Manage Guides
ru: Управление ресурсами
uz: Resurslarni boshqarish

# manageResourcesSubtitle
source: Oversee all learning resources (future)
ru: Управление всеми учебными ресурсами (в будущем)
uz: Barcha o'quv resurslarini nazorat qilish (kelajakda)

# confirmDeleteTitle
source: Confirm Deletion
ru: Подтвердить удаление
uz: O'chirishni tasdiqlang

# confirmDeleteNewsMessage
source: Are you sure you want to delete "{newsTitle}"?
ru: Вы уверены, что хотите удалить "{newsTitle}"?
uz: Siz "{newsTitle}"ni o'chirib tashlamoqchimisiz?

# newsDeletedSuccess
source: "{newsTitle}" deleted successfully.
ru: "{newsTitle}" успешно удален.
uz: "{newsTitle}" muvaffaqiyatli o'chirildi.

# failedToDeleteNews
source: Failed to delete "{newsTitle}": {error}
ru: Не удалось удалить "{newsTitle}": {error}
uz: "{newsTitle}" o'chirilmadi: {error}

# addNewsTooltip
source: Add New News Article
ru: Добавить новую новостную статью
uz: Yangi maqola qo'shish

# editNewsTooltip
source: Edit News
ru: Редактировать новость
uz: Yangilikni tahrirlash

# deleteNewsTooltip
source: Delete News
ru: Удалить новость
uz: Yangilikni o'chirish

# addNewsButton
source: Add News
ru: Добавить новость
uz: Yangilik qo'shish

# noNewsAvailableManager
source: No news articles found. Add one!
ru: Нет новостных статей. Добавьте одну!
uz: Hech qanday yangilik maqolasi topilmadi. Bittasini qo'shing!

# editNewsTitle
source: Edit News
ru: Редактировать новость
uz: Yangilikni tahrirlash

# addNewsTitle
source: Add News Article
ru: Добавить новостную статью
uz: Yangilik maqolasini qo'shish

# saveNewsTooltip
source: Save News
ru: Сохранить новость
uz: Yangilikni saqlash

# newsTitleLabel
source: Title
ru: Заголовок
uz: Sarlavha

# pleaseEnterNewsTitle
source: Please enter a news title.
ru: Введите заголовок новости
uz: Iltimos, yangilik sarlavhasini kiriting.

# newsTitleMinLength
source: News title must be at least {length} characters.
ru: Заголовок новости должен быть не менее {length} символов
uz: Yangiliklar nomi kamida {length} belgidan iborat bo'lishi kerak.

# newsSourceLabel
source: Source (e.g., Blog Name)
ru: Источник (например, название блога)
uz: Manba (masalan, Blog nomi)

# pleaseEnterNewsSource
source: Please enter the news source.
ru: Введите источник новостей
uz: Iltimos, yangiliklar manbasini kiriting.

# newsUrlLabel
source: Article URL
ru: URL статьи
uz: Maqola URL manzili

# pleaseEnterNewsUrl
source: Please enter the article URL.
ru: Введите URL статьи
uz: Maqola URL manzilini kiriting.

# pleaseEnterValidNewsUrl
source: Please enter a valid URL (starting with http or https).
ru: Введите действительный URL (начинающийся с http или https).
uz: Iltimos, to'g'ri URL manzilini kiriting (http yoki https bilan boshlanadi).

# newsImageUrlLabel
source: Image URL (Optional)
ru: URL изображения (необязательно)
uz: Rasm URL manzili (ixtiyoriy)

# pleaseEnterValidImageUrl
source: Please enter a valid image URL (starting with http or https), or leave blank.
ru: Введите действительный URL изображения (начинающийся с http или https) или оставьте поле пустым.
uz: Iltimos, haqiqiy rasm URL manzilini kiriting (http yoki https bilan boshlanadi) yoki bo'sh qoldiring.

# publicationDateLabel
source: Publication Date
ru: Дата публикации
uz: Nashr qilingan sana

# pleaseSelectPublicationDate
source: Please select a publication date.
ru: Выберите дату публикации.
uz: Iltimos, nashr sanasini tanlang.

source: No date selected
ru: Дата не выбрана
uz: Sana tanlanmagan

# selectDateTooltip
source: Select Date
ru: Выберите дату
uz: Sanani tanlang

# updateNewsButton
source: Update News
ru: Обновить новости
uz: Yangiliklarni yangilash

# addNewsButtonForm
source: Add News Article
ru: Добавить новостную статью
uz: Yangilik maqolasini qo'shish

# newsUpdatedSuccess
source: "{newsTitle}" updated successfully.
ru: "{newsTitle}" успешно обновлено.
uz: "{newsTitle}" muvaffaqiyatli yangilandi.

# newsAddedSuccess
source: "{newsTitle}" added successfully.
ru: "{newsTitle}" успешно добавлено.
uz: "{newsTitle}" muvaffaqiyatli qo'shildi.

# failedToSaveNews
source: Failed to save news: {error}
ru: Не удалось сохранить новости: {error}
uz: Yangilikni saqlab bo'lmadi: {error}

# errorLoadingUsers
source: Error loading users: {error}
ru: Ошибка загрузки пользователей: {error}
uz: Foydalanuvchilarni yuklashda xatolik yuz berdi: {error}

source: No users found.
ru: Пользователи не найдены.
uz: Hech qanday foydalanuvchi topilmadi.

source: No email provided
ru: Адрес электронной почты не указан
uz: E-pochta taqdim etilmaydi

# roleLabel
source: Role
ru: Роль
uz: Rol
